{
  "name": "The Rolling Stones",
  "genre": "Rock, Blues Rock, Hard Rock, Rock and Roll",
  "description": "The Rolling Stones stand as one of the most influential and enduring rock bands in music history, forming in London in 1962. Originally conceived as a blues cover band by childhood friends Mick Jagger and Keith Richards, they quickly evolved into pioneering architects of rock and roll, developing their distinctive sound that merged Chicago blues, R&B, and early rock and roll with British invasion energy. The band's core lineup, featuring Jagger's distinctive vocals, Richards' innovative guitar work, and Charlie Watts' steady drumming (until his passing in 2021), created a musical chemistry that has proven nearly impossible to replicate. Throughout their six-decade career, the Stones have consistently reinvented themselves while maintaining their bluesy rock foundation, from the psychedelic experimentation of 'Their Satanic Majesties Request' to the country-tinged 'Exile on Main St.' and the disco-influenced 'Some Girls.' Their songwriting partnership of Jagger-Richards has produced an unparalleled catalog of hits, including '(I Can't Get No) Satisfaction,' 'Paint It Black,' and 'Start Me Up.' The band's live performances are legendary, characterized by raw energy and theatrical showmanship, particularly from frontman Jagger. Despite personal conflicts, lineup changes, and evolving musical landscapes, the Stones have maintained their relevance and continued touring well into their seventies. Their influence extends beyond music into fashion, attitude, and popular culture, helping define the very essence of rock and roll rebellion. The band's longevity and continued creativity defy conventional wisdom about aging in rock music, as they continue to release new material and sell out stadiums worldwide. Their sound has influenced countless artists across multiple generations, from punk to alternative rock to modern blues revival acts.",
  "vibe": "Rebellious, energetic, bluesy, raw, iconic",
  "tiktok_summary": "Moderate TikTok presence with 123,889 followers, maintaining regular content output through their official account @therollingstones. Their platform engagement suggests room for growth in reaching younger audiences.",
  "instagram_summary": "Established Instagram presence with 90,126 followers, actively sharing content as @therollingstones. Their profile indicates ongoing musical activity and LA-based operations.",
  "overall_score": "Legendary status in music history with strong traditional media presence, though digital platform following is relatively modest compared to their historical impact",
  "growth_potential": "Significant potential for digital platform growth, particularly in reaching new generations through TikTok and Instagram, leveraging their iconic status and vast musical catalog",
  "created_date": "2025-07-10T17:11:45.965369",
  "last_updated": "2025-07-10T17:11:45.965380"
}