{
  "name": "Cat Matthews",
  "genre": "Indie Pop, Alternative, Singer-Songwriter",
  "description": "Cat Matthews represents a fresh voice in the Los Angeles indie music scene, crafting intimate and emotionally resonant songs that blend contemporary pop sensibilities with raw, confessional songwriting. Originally from the Midwest, Matthews developed her musical foundation through years of classical piano training before discovering her true calling as a vocalist and songwriter in her late teens. Her sound incorporates elements of bedroom pop, indie folk, and alternative music, characterized by ethereal vocal harmonies, introspective lyrics, and carefully layered production that maintains an organic feel. Working primarily from her home studio in East Los Angeles, Matthews has cultivated a distinctive approach to songwriting that begins with voice memos and acoustic guitar, gradually building arrangements through digital experimentation and collaborative sessions with local musicians. Her influences range from Phoebe Bridgers and Japanese Breakfast to classic songwriters like Joni Mitchell, evident in her sophisticated melodic sensibility and narrative-driven lyrics. Since releasing her first EP in 2021, Matthews has steadily built a devoted following through consistent digital content creation and intimate live performances at venues across LA's Echo Park and Silver Lake neighborhoods. Her production style embraces both modern electronic elements and traditional instrumental arrangements, creating a sonic landscape that feels both contemporary and timeless. Beyond her music, Matthews has become known for her authentic social media presence, sharing behind-the-scenes glimpses of her creative process and daily life as an independent artist. Her background in visual arts also influences her aesthetic approach, resulting in carefully curated music videos and artwork that complement her musical output.",
  "vibe": "Intimate, ethereal, authentic, with a blend of modern indie production and classic songwriting sensibilities",
  "tiktok_summary": "Strong TikTok presence with 333K+ followers, consistently posting daily content focused on music and behind-the-scenes material. Handle @catnipmatthews shows active engagement and professional approach to platform management.",
  "instagram_summary": "Growing Instagram following of nearly 50K followers, maintaining professional artist presence with focus on music releases and LA-based activities. Handle @catmatthews demonstrates strategic platform usage for music promotion.",
  "overall_score": "7.8/10 - Showing strong digital presence with particular success on TikTok, balanced by growing traditional music platform engagement",
  "growth_potential": "High - demonstrates strong content creation capabilities, established TikTok following provides solid foundation for cross-platform growth and music promotion",
  "created_date": "2025-07-10T17:10:46.744458",
  "last_updated": "2025-07-10T17:10:46.744470"
}