{
  "name": "Whatmore",
  "genre": "Pop, Alternative Pop, Electronic Pop",
  "description": "Whatmore represents an emerging force in contemporary American pop music, formed as a dynamic male group bringing fresh energy to the Los Angeles music scene. Their sound seamlessly blends electronic production elements with organic instrumentation, creating a distinctive sonic landscape that bridges mainstream pop accessibility with alternative edge. The group's creative process typically involves collaborative songwriting sessions where they craft lyrics that often explore themes of modern relationships, self-discovery, and social connection in the digital age. Their production style incorporates synthesizer-driven melodies, punchy electronic beats, and layered vocal harmonies that showcase their collective vocal abilities. Drawing influence from both contemporary pop innovators and classic vocal groups, Whatmore has developed a sound that feels both familiar and forward-looking. The group's journey began in the late 2010s, starting as independent artists who built their following through social media and digital platforms. Their approach to music-making emphasizes authenticity and relatability, often incorporating elements of their personal experiences into their songwriting. The members' diverse musical backgrounds, ranging from classical training to self-taught production skills, contribute to their eclectic sound. Their live performances are known for high-energy choreography and vocal arrangements that highlight each member's unique talents. The group has shown particular skill in creating content that resonates with digital-native audiences while maintaining musical credibility. Their studio work demonstrates attention to detail in production, with songs that often feature intricate arrangements and contemporary pop soundscapes.",
  "vibe": "Energetic, youthful, contemporary with a blend of polished production and authentic expression",
  "tiktok_summary": "Strong TikTok presence with over 100K followers, maintaining consistent daily content strategy. Active engagement through music-focused posts and regular updates, showing solid platform understanding and community building.",
  "instagram_summary": "Growing Instagram presence with 7K+ followers, primarily focused on music and behind-the-scenes content. LA-based presence helps maintain industry connections, though following is still developing compared to TikTok.",
  "overall_score": "Demonstrates promising digital presence with particularly strong TikTok performance, showing effective platform-specific content strategy despite relatively early career stage.",
  "growth_potential": "High potential for growth, especially given strong TikTok engagement and room for Instagram expansion. Current trajectory suggests opportunity for significant audience development across platforms.",
  "created_date": "2025-07-10T17:14:21.291974",
  "last_updated": "2025-07-10T17:14:21.291986"
}